Tekla Open API Reference for Tekla Structures 2025
RebarPropertyModifier.FatherPart Property
 Gets or sets the father part for all bars touching the property modifier.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Part FatherPart { get; set; }
Public Property FatherPart As Part
	Get
	Set
Property Value
Type: Part
See Also
Reference
RebarPropertyModifier Class
Tekla.Structures.Model Namespace